# Напишите программу, которая получает целое число и возвращает его двоичное,
# восьмеричное строковое представление.
# Функции bin и oct используйте для проверки своего результата.
# *Дополнительно
# Попробуйте избежать дублирования кода в преобразованиях к разным системам счисления
# Избегайте магических чисел. Добавьте аннотацию типов где это возможно.

num: int = int(input('Enter natural number = '))
# Разрядность целого типа int составляет 32 бита (2^32) или от -2 147 483 648 до 2 147 483 647.
# Так как числа будут представляться в двоичном/восьмеричном измерении, то диапазон сократится
# от 0 до 2 147 483 647, т.е. 2^31
print(bin(num))
#print(oct(num))

i = 31
arr_bin = []
str_bin = ''
dict_oct = {'000': 0, '001': 1, '010': 2, '011': 3,
            '100': 4, '101': 5, '110': 6, '111': 7 }
while i > 0:
    arr_bin.append(num % 2)
    num //= 2
    i = i - 1
    
for i in arr_bin[::-1]:
    str_bin += str(i)

print(int(str_bin))
