# Даны два многочлена, которые вводит пользователь.
# Задача - сформировать многочлен, содержащий сумму многочленов.
# Степени многочленов могут быть разные.

# Например на входе 2x^2 + 4x + 5 = 0 и 5x^3 - 3*x^2 - 12 = 0
# на выходе будет 5x^3 - x^2 + 4х - 7 = 0
# Можно использовать модуль re

exp_max1: int = int(input('Введите максимальную натуральную степень первого многочлена: '))
exp_max2: int = int(input('Введите максимальную натуральную степень второго многочлена: '))

arr_plm1 = [int(input(f'Введите коэффициент при x в степени {i} = ')) for i in range(exp_max1, -1, -1)]
print(arr_plm1) # Коэффициенты первого многочлена

arr_plm2 = [int(input(f'Введите коэффициент при x в степени {i} = ')) for i in range(exp_max2, -1, -1)]
print(arr_plm2) # Коэффициенты второго многочлена