# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто,
# насколько легко он их придумывает, Вам стоит написать программу.
# Винни-Пух считает, что ритм есть, если число слогов
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов,
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке
# и “Пам парам”, если с ритмом все не в порядке

# Пример:

# Ввод: пара-ра-рам рам-пам-папам па-ра-па-да    
# Вывод: Парам пам-пам

# Число слогов = количеству гласных букв
# пример: в слове 'Ураааааа' 7 слогов ('У-ра-а-а-а-а-а')

def PhraseCounter(poesy):
    vowels = 'аоиеёяуыюэ'
    counter = []
    for item in range(len(poesy)):
        count = 0
        for iter in range(len(poesy[item])):
            if poesy[item][iter] in vowels:
                count += 1
        counter.append(count)
    return counter

RhythmCheck = lambda spisok: all(spisok[i] == spisok[i + 1] for i in range(len(spisok) - 1))
    
def Start():
    strr = input('Введите фразы в одну строку\n').lower().split()
    if RhythmCheck(PhraseCounter(strr)):
        print('Парам пам-пам')
    else: print('Пам парам')

Start()
