# print('a', 'b', 'c', sep='-', end=' ')
# print(1, 2, 3, sep='+')

# name = input('Enter Your name: ')
# print(f'Hello, {name}!')

"""
n = int(input())

if n < 0:
    print('Меньше нуля')
elif n%2 == 0:
    print('Четное')
elif n%3 == 0:
    print('Нечетное и делится на 3')
else:
    print('Нечетное')
"""
#"""
a=[1,2,3,4]

# for element in a:
#     print(element)

# for i in range(len(a)):
#     if a[i]>2:
#         print(f'{i+1}-th element > 2')

# Более профессионально:
# for i, element in enumerate(a):
#     if element > 2:
#         print(f'{i+1}-th element > 2')

# for i in range(0,10,5):     # в скобках нач. число, конечное число, шаг
#     print(i)
#"""
# n=10

# while n>1:      # опасность - падение в бесконечный цикл
#     print(n)
#     n -= 1

# Задача 1.
# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.
"""
from math import ceil

n = int(input('Enter distance per day: '))
m = int(input('Enter distance: '))

print(ceil(m/n))
"""

# Задача 3.
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
"""
print('Введите количество учащихся в первом классе: ')
a = int(input())
print('Введите количество учащихся во втором классе: ')
b = int(input())
print('Введите количество учащихся в третьем классе: ')
c = int(input())
print(f'необходимо приобрести {(a+1)//2 + (b+1)//2 + (c+1)//2} парты')
"""

# Задача 5.
# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.
"""
i = int(input('Введите i: '))
j = int(input('Введите j: '))
if i != j:
    print(f'Количество вагонов в электричке {(i+j-1)}')
else:
    print('Без дополнительной информации определить количество вагонов невозможно')
"""

# Задача 7.
# Дано натуральное число. Требуется определить,
# является ли год с данным номером високосным. Если
# год является високосным, то выведите YES, иначе
# выведите NO. Напомним, что в соответствии с
# григорианским календарем, год является
# високосным, если его номер кратен 4, но не кратен
# 100, а также если он кратен 400.
"""
year = int(input('Введите год: '))

if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print('YES')
else:
    print('NO')
"""

# ---------------------------------------------------------------------------------------------

# from math import ceil

# n = int(input('Enter distance per day: '))
# m = int(input('Enter all distance: '))
# print(f'{ceil(m/n)} day')

# ---------------------------------------------------------------------------------------------

# from math import ceil

# first_room = int(input('Enter tables first room: '))
# second_room = int(input('Enter tables second room: '))
# third_room = int(input('Enter tables third room: '))
# print(ceil(first_room/2)+ceil(second_room/2)+ceil(third_room/2))

# ---------------------------------------------------------------------------------------------
# Задание 5. Пришел клиент чтоб сделать заявку на кредит , зовут его Иван Николаевич,
# ему 48 лет, он получает 50 000 в месяц, но тратит на обслуживание всех кредитов 18 500 в месяц. 
# Подсказка - удобно будет забить исходные данные в переменные в начале программы.
# Теперь опишем то, как выполняется процесс рассмотрения заявки в нашем условном банке.
# Проверяем два фактора. Первый - срок окончания обслуживания кредита не должен выходить за 50-ый год жизни клиента.
# То есть, если клиенту 49 лет, и он хочет взять кредит на 15 месяцев, то отказ.
# Второй фактор - общая сумма выплачиваемых клиентом кредитов вместе с потенциальным не должна превышать
# 50 % его заработной платы. То есть если он платил 20 000 рублей при зарплате в 60 000 рублей
# и обслуживание нового кредита составит дополнительно плюсом 16000 рублей в месяц, то отказ.
# Если же оба фактора одновременно не выполняются, то одобряем заявку на кредит. 
# Напишите программу, которая решает, выдать ли кредит Ивану Николаевичу или нет.
# Она запрашивает у пользователя сумма кредита и на сколько месяцев  клиент хочет взять кредит.
# На выходе - решение банка об одобрении или отказе.

age = 48*12
salary = 50000
loan_servicing = 18500
sum = int(input('Enter monthly loan payment: '))
month = int(input('Enter count of months: '))
if age + month < 50*12 or loan_servicing + sum <= salary//2:
    print('Approved')
else:
    print('Refusing')