# print('a', 'b', 'c', sep='-', end=' ')
# print(1, 2, 3, sep='+')

# name = input('Enter Your name: ')
# print(f'Hello, {name}!')

"""
n = int(input())

if n < 0:
    print('Меньше нуля')
elif n%2 == 0:
    print('Четное')
elif n%3 == 0:
    print('Нечетное и делится на 3')
else:
    print('Нечетное')
"""

# a=[1,2,3,4]

# for element in a:
#     print(element)
"""
for i in range(len(a)):
    if a[i]>2:
        print(f'{i}-th element ')
"""
"""
# Более профессионально:
for i, element in enumerate(a):
    if element > 2:
        print(f'{i}-th element > 2')

for i in range(0,10,5):     # в скобках нач. число, конечное число, шаг
    print(i)
"""
# n=10

# while n>1:      # опасность - падение в бесконечный цикл
#     print(n)
#     n -= 1

# Задача 1.
# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.
"""
from math import ceil

n = int(input('Enter distance per day: '))
m = int(input('Enter distance: '))

print(ceil(m/n))
"""

# Задача 3.
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
"""
print('Введите количество учащихся в первом классе: ')
a = int(input())
print('Введите количество учащихся во втором классе: ')
b = int(input())
print('Введите количество учащихся в третьем классе: ')
c = int(input())
print(f'необходимо приобрести {(a+1)//2 + (b+1)//2 + (c+1)//2} парты')
"""

# Задача 5.
# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.
"""
i = int(input('Введите i: '))
j = int(input('Введите j: '))
if i != j:
    print(f'Количество вагонов в электричке {(i+j-1)}')
else:
    print('Без дополнительной информации определить количество вагонов невозможно')
"""

# Задача 7.
# Дано натуральное число. Требуется определить,
# является ли год с данным номером високосным. Если
# год является високосным, то выведите YES, иначе
# выведите NO. Напомним, что в соответствии с
# григорианским календарем, год является
# високосным, если его номер кратен 4, но не кратен
# 100, а также если он кратен 400.

year = int(input('Введите год: '))

if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print('YES')
else:
    print('NO')