# По данному целому неотрицательному n вычислите значение n!.
# N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N) 0! = 1
# Решить задачу используя цикл while
"""
n = int(input('Enter number: '))
fact = 1
res = 1

while fact <= n:
    res *= fact
    fact += 1
print(res)

# ---------------------------------
n = int(input('Enter number: '))
res = 1
while n > 0:
    res *= n
    n -= 1
print(res)
"""
# Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является,
# то есть выведите такое число n, что φ(n)=A. Если А не является числом Фибоначчи, выведите число -1.
"""
n = int(input('Введите число Фибоначчи: '))
n0 = 0  #хранит первое число
n1 = 1  #хранит второе число
n2 = 0  #хранит сумму двух предыдущих членов

# i = 1   #счетчик
# while n0 < n:
#     n2 = n0 + n1
#     n0 = n1
#     n1 = n2
#     i += 1
#     if n0 > n:
#         i = -1
# print(i)

i = 2   #счетчик
while n2 < n:
    n2 = n0 + n1
    n0 = n1
    n1 = n2
    i += 1
    if n2 > n:
        i = -1
print(i)
"""
"""
# Уставшие от необычно теплой зимы, жители решили узнать,
# действительно ли это самая длинная оттепель за всю историю наблюдений за погодой.
# Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за прошлые годы.
# Их интересует, сколько дней длилась самая длинная оттепель.
# Оттепелью они называют период, в который среднесуточная температура ежедневно превышала 0 градусов Цельсия.
# Напишите программу, помогающую синоптикам в работе.
# Пользователь вводит число N – общее количество рассматриваемых дней (1 ≤ N ≤ 100).
# В следующих строках располагается N целых чисел. 
# Каждое число – среднесуточная температура в соответствующий день.
# Температуры – целые числа и лежат в диапазоне от –50 до 50

n = int(input())
count = 0
max1 = 0
for i in range(n):
    temp = int(input())
    if temp > 0:
        count += 1
        if count > max1:
            max1 = count
    else:
        count = 0
print("count = ", max1)
"""

# Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя,
# а другой для тещи. Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче.
# Но вот незадача: арбузов слишком много и он не знает как же выбрать самый легкий
# и самый тяжелый арбуз? Помогите ему!
# Пользователь вводит одно число N – количество арбузов.
# Вторая строка содержит N чисел, записанных на новой строчке каждое.
# Здесь каждое число – это масса соответствующего арбуза

# n = int(input('Введите количество арбузов: '))
# kg = int(input('1-й арбуз = '))
# min1 = max1 = kg
# for i in range(n-1):
#     kg = int(input(f'{i+2}-й арбуз = '))
#     if kg > max1:
#         max1 = kg
#     elif kg < min1:
#         min1 = kg
# print(f'Самый маленький арбуз = {min1} кг, самый большой арбуз = {max1} кг')

# ----------------------------------------------------------------------------------------------------
"""
sp = []
sp.append(65465)
sp.append("privet")
sp.append(4.5)
sp.append([5,7])
sp.append(True)
print(sp)

i=0
while i<10:
    print(i, "hahaha ",sep = " --- ",end = " ; ")
    i +=1

for _ in range(4):
    print("hello")

for i in sp:
    print(i)

for i in range(5,15,3):
    print(i)
"""
# Задача 9
# По данному целому неотрицательному n вычислите значение n!. N! = 1 * 2 * 3 * … * N (произведение всех
# чисел от 1 до N) 0! = 1 Решить задачу используя цикл while
"""
n = int(input('Enter number: '))
res = 1
i = 1
while i <= n:
    res *= i
    i += 1
print(res)
"""
# Задача 11
# Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является, то есть
# выведите такое число n, что φ(n)=A. Если А неявляется числом Фибоначчи, выведите число -1.
# 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711
"""
a = int(input('Enter number: '))
n1 = 0  # первое число
n2 = 1  # второе число
n3 = 0  # сумма двух предыдущих членов

i = 1
while n1 < a:
    n3 = n1 + n2
    n1 = n2
    n2 = n3
    i += 1
    if n1 > a:
        i = -1
print(i)
"""

# Задача 13
# Уставшие от необычно теплой зимы, жители решили узнать, действительно ли это самая длинная оттепель за всю историю
# наблюдений за погодой. Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за
# прошлые годы. Их интересует, сколько дней длилась самая длинная оттепель. Оттепелью они называют период, в
# который среднесуточная температура ежедневно превышала 0 градусов Цельсия. Напишите программу, помогающую
# синоптикам в работе. Пользователь вводит число N – общее количество
# рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках располагается N целых чисел.
# Каждое число – среднесуточная температура в соответствующий день. Температуры – целые числа и лежат в
# диапазоне от –50 до 50
"""
import random

N = int(input('Введите количество отслеживаемых дней: '))
count = 0
max = 0

for i in range(N):
    temp = random.randint(-50, 50)
    print(temp)
    if temp > 0:
        count += 1
        if count > max:
            max = count
    else:
        count = 0

print("count = ", max)
"""

# Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат

# x = bool(input('Введите X: '))
# y = bool(input('Введите Y: '))
# z = bool(input('Введите Z: '))

# left_side = not (x or y or z)
# right_side = not x and not y and not z
# if left_side == right_side:
#     print('Утверждение верно')
# else:
#     print('Неверно')

# result = True if not (x or y or z) == (not x and not y and not z) else False

"""
for value in range(pow(2, 3)):
    temp = str(bin(value)).lstrip('0b')
    while len(temp) < 3:
        temp = '0' + temp
    print(temp)

    x = temp[0]
    y = temp[1]
    z = temp[2]
    print(f'¬({x} ⋁ {y} ⋁ {z}) = ¬{x} ⋀ ¬{y} ⋀ ¬{z}')
    left_side = not (x or y or z)
    right_side = not x and not y and not z
    if left_side == right_side:
        print('Утверждение верно')
    else:
        print('Неверно')

    result = True if not (x or y or z) == (not x and not y and not z) else False
    """