# По данному целому неотрицательному n вычислите значение n!.
# N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N) 0! = 1
# Решить задачу используя цикл while
"""
n = int(input('Enter number: '))
fact = 1
res = 1

while fact <= n:
    res *= fact
    fact += 1
print(res)

# ---------------------------------
n = int(input('Enter number: '))
res = 1
while n > 0:
    res *= n
    n -= 1
print(res)
"""
# Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является,
# то есть выведите такое число n, что φ(n)=A. Если А не является числом Фибоначчи, выведите число -1.
"""
n = int(input('Введите число Фибоначчи: '))
n0 = 0  #хранит первое число
n1 = 1  #хранит второе число
n2 = 0  #хранит сумму двух предыдущих членов

# i = 1   #счетчик
# while n0 < n:
#     n2 = n0 + n1
#     n0 = n1
#     n1 = n2
#     i += 1
#     if n0 > n:
#         i = -1
# print(i)

i = 2   #счетчик
while n2 < n:
    n2 = n0 + n1
    n0 = n1
    n1 = n2
    i += 1
    if n2 > n:
        i = -1
print(i)
"""
"""
# Уставшие от необычно теплой зимы, жители решили узнать,
# действительно ли это самая длинная оттепель за всю историю наблюдений за погодой.
# Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за прошлые годы.
# Их интересует, сколько дней длилась самая длинная оттепель.
# Оттепелью они называют период, в который среднесуточная температура ежедневно превышала 0 градусов Цельсия.
# Напишите программу, помогающую синоптикам в работе.
# Пользователь вводит число N – общее количество рассматриваемых дней (1 ≤ N ≤ 100).
# В следующих строках располагается N целых чисел. 
# Каждое число – среднесуточная температура в соответствующий день.
# Температуры – целые числа и лежат в диапазоне от –50 до 50

n = int(input())
count = 0
max1 = 0
for i in range(n):
    temp = int(input())
    if temp > 0:
        count += 1
        if count > max1:
            max1 = count
    else:
        count = 0
print("count = ", max1)
"""

# Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя,
# а другой для тещи. Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче.
# Но вот незадача: арбузов слишком много и он не знает как же выбрать самый легкий
# и самый тяжелый арбуз? Помогите ему!
# Пользователь вводит одно число N – количество арбузов.
# Вторая строка содержит N чисел, записанных на новой строчке каждое.
# Здесь каждое число – это масса соответствующего арбуза

n = int(input('Введите количество арбузов: '))
kg = int(input('1-й арбуз = '))
min1 = max1 = kg
for i in range(n-1):
    kg = int(input(f'{i+2}-й арбуз = '))
    if kg > max1:
        max1 = kg
    elif kg < min1:
        min1 = kg
print(f'Самый маленький арбуз = {min1} кг, самый большой арбуз = {max1} кг')
