# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали
# одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#Петя   Сережа   П+С    Катя    Вместе(S)
#   1        1     2       4           6
#   2        2     4       8          12
#   3        3     6      12          18
#   4        4     8      16          24
#   5        5    10      20          30
#   9        9    18      36          54
# То есть количество журавликов, сделанные детьми должно быть кратно 6, чтобы соблюдалось условию задачи

S = int(input('Enter a multiple of 6: '))

if S%6 == 0:
    p = S/6
    k = 4*p
    print(f'Петя и Сережа сделали по {int(p)} журавликов, а Катя сделала {int(k)} журавликов.', end = " ")
    print(f'Вместе они сделали {S} журавликов.')
else:
    print('Error: Enter a multiple of 6')

